posts.org
#+STARTUP: content
#+author:
#+HUGO_BASE_DIR: ./
#+hugo_auto_set_lastmod: t
#+OPTIONS: ^:nil
#+STARTUP: latexpreview

*** DONE Import custom package or module in PySpark                 :Spark:
CLOSED: [2020-04-02 Sun 22:24]
   :PROPERTIES:
   :EXPORT_FILE_NAME: import-custom-package-or-module-in-pyspark
   :END:

First zip all of the dependencies into zip file like this. Then you can use one of the following methods to import it.

#+begin_src 
|-- kk.zip
|   |-- kk.py
#+end_src
**** Using --py-files in spark-submit

When submit spark job, add =--py-files=kk.zip= parameter. =kk.zip= will be distributed with the main scrip file, and =kk.zip= will be inserted at the beginning of =PATH= environment variable.

Then you can use =import kk= in your main script file.

This utilize Python's zip import feature. For more information, check this link: [[https://docs.python.org/3.8/library/zipimport.html][zipimport]] 
 

**** Using addPyFile in main script

You can also upload zip file to hdfs, and using ~sc.addPyFile('hdfs://kk.zip')~ after =SparkContext= is initialized.

This has the same effect as =--py-files=, but your import statement must be after this line.

